test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 1
      maxVusers: 5
      name: "Разогрев"
    - duration: 40
      arrivalRate: 2
      maxVusers: 15
      name: "Основная нагрузка"
    - duration: 20
      arrivalRate: 3
      maxVusers: 15
      name: "Пик"

  defaults:
    headers:
      Content-Type: "application/json"

  processor: "./processor.js"

scenarios:
  - name: "Хороший заявитель"
    weight: 40
    flow:
      - function: "generateUser"
      - function: "generateGoodApplicant"
      - post:
          url: "/api/auth/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
      - post:
          url: "/api/predict"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Socket-Id: "{{ socketId }}"
          json:
            age: "{{ age }}"
            occupation: "{{ occupation }}"
            marital_status: "{{ maritalStatus }}"
            dependents: "{{ dependents }}"
            residential_status: "Own"
            address_duration: "{{ addressDuration }}"
            credit_score: "{{ creditScore }}"
            income_level: "{{ incomeLevel }}"
            loan_amount_requested: "{{ loanAmount }}"
            loan_term: "{{ loanTerm }}"
            purpose_of_loan: "{{ purpose }}"
            collateral: "Yes"
            interest_rate: "{{ interestRate }}"
            previous_loans: "{{ previousLoans }}"
            existing_liabilities: "{{ existingLiabilities }}"
            application_behavior: "Normal"
            location_of_application: "Local"
            change_in_behavior: "No"
            time_of_transaction: "{{ transactionTime }}"
            account_activity: "Normal"
            payment_behavior: "On-time"
            blacklists: "No"
            employment_verification: "Verified"
            past_financial_malpractices: "No"
            device_information: "{{ device }}"
            social_media_footprint: "Yes"
            consistency_in_data: "Consistent"
            referral: "Online"
            socket_id: "{{ socketId }}"
          expect:
            - statusCode: 202
      - get:
          url: "/api/history/stats"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Рискованный заявитель"
    weight: 35
    flow:
      - function: "generateUser"
      - function: "generateBadApplicant"
      - post:
          url: "/api/auth/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
      - post:
          url: "/api/predict"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Socket-Id: "{{ socketId }}"
          json:
            age: "{{ age }}"
            occupation: "Unemployed"
            marital_status: "Single"
            dependents: "{{ dependents }}"
            residential_status: "Rent"
            address_duration: 1
            credit_score: "{{ creditScore }}"
            income_level: "{{ incomeLevel }}"
            loan_amount_requested: "{{ loanAmount }}"
            loan_term: "{{ loanTerm }}"
            purpose_of_loan: "personal"
            collateral: "No"
            interest_rate: 9.5
            previous_loans: 0
            existing_liabilities: "{{ existingLiabilities }}"
            application_behavior: "Rapid"
            location_of_application: "Unusual"
            change_in_behavior: "Yes"
            time_of_transaction: "{{ transactionTime }}"
            account_activity: "Unusual"
            payment_behavior: "{{ paymentBehavior }}"
            blacklists: "{{ blacklisted }}"
            employment_verification: "Not Verified"
            past_financial_malpractices: "Yes"
            device_information: "Mobile"
            social_media_footprint: "No"
            consistency_in_data: "Inconsistent"
            referral: "Online"
            socket_id: "{{ socketId }}"
          expect:
            - statusCode: 202

  - name: "Просмотр истории"
    weight: 25
    flow:
      - function: "generateUser"
      - post:
          url: "/api/auth/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/history?limit=50"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/history/stats"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/health"